Revit 2026 API

# GenericFormSetVisibility Method

---

Sets the visibility for the generic form.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetVisibility(
	FamilyElementVisibility visibility
)
```
```vb
Public Sub SetVisibility (
	visibility As FamilyElementVisibility
)
```
```cpp
public:
void SetVisibility(
	FamilyElementVisibility^ visibility
)
```
```fsharp
member SetVisibility :
        visibility : FamilyElementVisibility -> unit
```

#### Parameters

visibility FamilyElementVisibility

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when visibility is . |
| InvalidOperationException | Thrown when regeneration failed. |

The visibility of the generic form geometry can be changed for different types of views and detail levels in the project.

#### Reference

GenericForm Class

Autodesk.Revit.DB Namespace